cylinder/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     	pimpleFoam;

startFrom       	startTime;

startTime       	0;

stopAt          	endTime;

endTime         	200;

deltaT          	0.001;

writeControl    	adjustableRunTime;

writeInterval   	1;

purgeWrite      	0;

writeFormat     	ascii;

writePrecision  	6;

writeCompression	off;

timeFormat      	general;

timePrecision   	6;

runTimeModifiable 	yes;

adjustTimeStep  	yes;

maxCo           	0.9;

maxDeltaT       	1.0;

// ************************************************************************* //

functions
{

	forceCoeffs_object
	{
		// rhoInf		Reference density
		// lRef			Reference length
		// Aref			Reference area
		// CofR			Centre of rotation
		// dragDir		Direction of drag coefficient
		// liftDir		Direction of lift coefficient
		// pitchAxis	Pitching moment axis
		// magUinf		Free stream velocity magnitude

		type				forceCoeffs;
		functionObjectLibs	("libforces.so");

		pName				p;
		Uname				U;
		rho					rhoInf;
		rhoInf				1.0;

		CofR				(0.0 0 0);
		liftDir				(0 1 0);
		dragDir				(1 0 0);
		pitchAxis			(0 0 1);
		magUInf				1.0;
		lRef				1.0;
		Aref				1.0;

		patches				("cylinder");
		log					true;
		writeControl		timeStep;
		writeInterval		1;
	}

}

// ************************************************************************* //