cylinder/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
	default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         				none;
    div(phi,U)						Gauss linearUpwindV grad(U);
    div(phi,k)						Gauss upwind;
    div(phi,omega)					Gauss upwind;
    div((nuEff*dev2(T(grad(U)))))	Gauss linear;
}

laplacianSchemes
{
     default         Gauss linear limited 1;
}

interpolationSchemes
{
	default			linear;
}

snGradSchemes
{
	default			limited 1;
}

wallDist
{
	method			meshWave;
}

// ************************************************************************* //
